<?php
/**
 * Created by PhpStorm.
 * User: andrey
 * Date: 4/26/18
 * Time: 11:37 AM
 */
/*
 * 28. Вывести таблицу умножения с помощью двух циклов for.
 *
 * Задача аналогична задаче 13. Поэтому, просто воспользуемся include.
 * Наверняка, не самый удачный пример использования include, логично было бы во внешних файлах размещать какие-то
 * библиотеки, функции, классы, которые можно при необходимости подключать. Мы же подключаем модуль с уже готовой программой.
 * Не очень красиво с точки зрения программирования, но зато посмотрим и убедимся что include работает.
 */

include '13.php';