<?php
/**
 * Created by PhpStorm.
 * User: alex
 * Date: 23.05.18
 * Time: 17:04
 */

//$str=<<<TTT
//1	Салат летний	З	Овощи	200.	3
//2	Салат мясной	З	Мясо	200.	4
//3	Салат витаминный	З	Овощи	200.	4
//4	Салат рыбный	З	Рыба	200.	4
//5	Паштет из рыбы	З	Рыба	120.	5
//6	Мясо с гарниром	З	Мясо	250.	3
//7	Сметана	З	Молоко	140.	1
//8	Творог	З	Молоко	140.	2
//9	Суп харчо	С	Мясо	500.	5
//10	Суп-пюре из рыбы	С	Рыба	500.	6
//11	Уха из судака	С	Рыба	500.	5
//12	Суп молочный	С	Молоко	500.	3
//13	Бастурма	Г	Мясо	300.	5
//14	Бефстроганов	Г	Мясо	210.	6
//15	Судак по-польски	Г	Рыба	160.	5
//16	Драчена	Г	Яйца	180.	4
//17	Морковь с рисом	Г	Овощи	260.	3
//18	Сырники	Г	Молоко	220.	4
//19	Омлет с луком	Г	Яйца	200.	5
//20	Каша рисовая	Г	Крупа	210.	4
//21	Пудинг рисовый	Г	Крупа	160.	6
//22	Вареники ленивые	Г	Молоко	220.	4
//23	Помидоры с луком	Г	Овощи	260.	4
//24	Суфле из творога	Г	Молоко	280.	6
//25	Рулет с яблоками	Д	Фрукты	200.	5
//26	Яблоки печеные	Д	Фрукты	160.	3
//27	Суфле яблочное	Д	Фрукты	220.	6
//28	Крем творожный	Д	Молоко	160.	4
//29	"Утро"	Н	Фрукты	200.	5
//30	Компот	Н	Фрукты	200.	2
//31	Молочный напиток	Н	Молоко	200.	2
//32	Кофе черный	Н	Кофе	200.	1
//33	Кофе на молоке	Н	Кофе	200.	2
//TTT;


$str=<<<TTT
1	Помидоры ...
2	Вареное ...
3	Зелень ме...
4	Вареные р...
5	Филе суда...
6	Мясо варе...
7	Сметану п...
8	Протертый ..
9	Грудинку ...
10	Филе суда...
11	Судак очи...
12	Промытый ...
13	Мясо наре...
14	Говядину ...
15	Подготовл...
16	Сырые яйц...
17	Нарезать ...
18	В протерт...
19	К свежим ...
20	Рис свари...
21	Готовую р...
22	В протерт...
23	Спассеров...
24	В протерт...
25	Очистить ...
26	Не прорез...
27	Запеченны...
28	Яйца разм...
29	Очищенную ..
30	Яблоки оч...
31	Яблоки на...
32	Кофеварку ..
33	Сварить ч...
TTT;

$str=<<<TTT
1	СЫТНЫЙ	рынок	Ленинград	Сытнинская, 3	2329916
2	ПОРТОС	кооператив	Резекне	Садовая, 27	317664
3	ШУШАРЫ	совхоз	Пушкин	Новая, 17	4705038
4	ТУЛЬСКИЙ	универсам	Ленинград	Тульская, 3	2710837
5	УРОЖАЙ	коопторг	Луга	Песчаная, 19	789000
6	ЛЕТО	агрофирма	Ленинград	Пулковское ш.,8	2939729
7	ОГУРЕЧИК	ферма	Паневежис	Укмерге, 15	127331
8	КОРЮШКА	кооператив	Йыхви	Нарвское ш., 64	432123 
TTT;
$str=<<<TTT
1	Говядина	189.	124.	0.	3150	90	600	1.5	28.	0
2	Судак	190.	80.	0.	1870	270	0	1.1	10.	30
3	Масло	60.	825.	90.	230	220	740	0.1	1.	0
4	Майонез	31.	670.	26.	480	280	0	0.	0.	0
5	Яйца	127.	115.	7.	1530	550	710	4.4	1.9	0
6	Сметана	26.	300.	28.	950	850	320	1.	1.	2
7	Молоко	28.	32.	47.	1460	1210	1500	1.3	1.	10
8	Творог	167.	90.	13.	1120	1640	1410	2.7	4.	5
9	Морковь	13.	1.	70.	2000	510	210	0.7	9.9	50
10	Лук	17.	0.	95.	1750	310	180	0.2	2.	100
11	Помидоры	6.	0.	42.	290	140	400	0.4	5.3	250
12	Зелень	9.	0.	20.	340	275	75	1.2	4.	380
13	Рис	70.	6.	773.	540	240	260	0.4	16.	0
14	Мука	106.	13.	732.	1760	240	120	1.2	22.	0
15	Яблоки	4.	0.	113.	2480	160	260	0.3	3.	130
16	Сахар	0.	0.	998.	30	20	10	0.	0.	0
17	Кофе	127.	36.	9.	9710	180	180	0.3	1.8	0
TTT;
$str=<<<TTT
1	108	429.84
2	0	0.00
3	73	274.61
4	39	97.46
5	61	111.83
6	88	206.60
7	214	83.08
8	92	82.80
9	0	0.00
10	77	46.30
11	46	51.70
12	13	34.96
13	54	51.14
14	91	43.77
15	117	189.92
16	98	96.14
17	37	166.50
TTT;
$str=<<<TTT
З 	Закуска
С 	Суп
Г 	Горячее
Д 	Десерт
Н 	Напиток
TTT;
$str=<<<TTT
1	З	3
2	З	1
3	З	6
1	З	6
2	З	6
3	З 	8
1	Г	19
2	С	9
3	Г	20
1	Г	21
2	С	12
3	Г	16
1	Н	31
2	Г	14
3	Н	30
1	Н	32
2	Г	16
3	Н	31
2	Г	18
2	Д	26
2	Д	28
TTT;
$str=<<<TTT
1	9
1	11	1.50	50
1	12	3.00	10
1	15	2.00	170
2	1	3.60	300
2	3
2	5	1.80	100
2	6	3.60	80
2	8
3	7	0.40	200
3	9
3	12	2.50	20
3	15	1.50	200
4	2
4	4	2.04	50
4	13	0.88	150
4	14
4	16	0.94	200
4	17	4.50	50
5	4	3.00	50
5	9
5	10	0.50	130
5	11
5	13	1.20	40
5	14	0.50	70
5	16	1.00	50
6	10	0.70	90
6	11
6	12
7	1	4.20	70
7	3	4.00	250
7	6	2.20	140
7	7
7	8	1.00	150
8	2
8	5	2.00	70
8	11	1.00	100
TTT;

$lines = explode("\n", $str);

array_walk($lines, function(&$value){
    $value = explode("\t", $value);
//    $value[4] = trim($value[4], '.');
    $value[1] = trim($value[1]);
});

$f = fopen('supplys.csv', 'w');

foreach($lines as $line) {
//    fputs($f, "{$line[0]},'{$line[1]}','{$line[2]}','{$line[3]}','{$line[4]}','{$line[5]}'\r\n");
//    fputs($f, "{$line[0]},'{$line[1]}','{$line[2]}','{$line[3]}',{$line[4]},{$line[5]}\r\n");
//    fputs($f, "{$line[0]},'{$line[1]}',{$line[2]}\r\n");
//    echo  "{$line[0]},'{$line[1]}',{$line[2]}\r\n";
//    fputs($f, "{$line[0]},'{$line[1]}',{$line[2]},{$line[3]},{$line[4]},{$line[5]},{$line[6]},{$line[7]},{$line[8]},{$line[9]},{$line[10]}\r\n");
    
    if (empty($line[2]))
    $line[2] = @(int)$line[2];
    if (empty($line[3]))
    $line[3] = @(int)$line[3];
    fputs($f, "{$line[0]},{$line[1]},{$line[2]},{$line[3]}\r\n");
}

fclose($f);
