<?php

// 25.Ваше задание создать массив, наполнить это случайными значениями (функция rand),
////// найти максимальное и минимальное значение и
// поменять их местами.


for ($i = 0; $i < 4; $i++)

{
    $a[] = rand(1, 50);
}

echo '--Масив--'.PHP_EOL;

PHP_EOL;PHP_EOL;PHP_EOL;PHP_EOL;

$Min = array_search(min($a), $a);
$Max = array_search(max($a), $a);


/////////////////////////////////////
$X = $Min - $Min + $Max; //////////// Х - мін
$Y = $Max - $Max + $Min; //////////// Y - макс
/////////////////////////////////////


echo "Min {$a[$X]}".PHP_EOL;
echo "Max {$a[$Y]}".PHP_EOL;

print_r($a);